using System;
//Используя Visual Studio, создайте проект по шаблону Console Application.
    //Напишите программу, которая будет рассчитывать и выводить на экран количество возможных вариантов доставки товара.
    //Для решения задачи, используйте факториал N!, рассчитываемый с помощью рекурсии.
    //Объясните, почему не рекомендуется использовать рекурсию для расчета факториала? Укажите слабые места данного подхода.
//```

namespace TeachMeSkills.DotNet.Task23
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
